--- a/README.md
+++ b/README.md
@@ -207,62 +228,80 @@ Save the following to the `.zed/settings.json` file:
+- In other words, in a graphical representation as below, dependency arrows can
+  never go upwards.
 
-```
-     ┌─────────────────────────────────┐
-     │           dataplane             │
-     └┬───────────┬─────────┬──────────┘
-      │           │         │
-      │           │         │
-      │           │   ┌─────▼────┐
-      │           │   │          │
-      │           │   │   mgmt   ┼───────────────┐      tier-3
-      │           │   │          │               │
-      │           │   └┬───────┬─┘               │
-      │           │    │       │                 │
- ┌────┘      ┌────▼────▼┐   ┌──▼───────┐         │
- │           │          │   │          │         │
- │     ┌─────┼   nat    │   │ routing  ┼───────┐ │      tier-2
- │     │     │          │   │          │       │ │
- │     │     └──────┬───┘   └──────────┘       │ │
- │     │            │                          │ │
-┌▼─────▼───┐  ┌─────▼────┐  ┌──────────┐  ┌────▼─▼───┐
-│          │  │          │  │          │  │          │
-│   net    │  │   lpm    │  │ pipeline │  │ config   │  tier-1
-│          │  │          │  │          │  │          │
-└───▲──────┘  └──────────┘  └───┬──────┘  └──────────┘
-    │                           │
-    └───────────────────────────┘
+```mermaid
+---
+title: Dependency cheat-sheet
+---
+graph TD
+    dataplane[dataplane<br/>tier-0]
+    mgmt[mgmt<br/>tier-3]
+    nat[nat<br/>tier-2]
+    routing[routing<br/>tier-2]
+    net[net<br/>tier-1]
+    lpm[lpm<br/>tier-1]
+    pipeline[pipeline<br/>tier-1]
+    config[config<br/>tier-1]
+
+    dataplane --> mgmt
+    dataplane --> nat
+    dataplane --> net
+    dataplane --> pipeline
+
+    mgmt --> nat
+    mgmt --> routing
+    mgmt --> config
+
+    nat --> lpm
+    nat --> net
+
+    routing --> config
+
+    pipeline --> net
 ```
 
 ## Workspace Dependency Graph
 
